--------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Data\DocEssay\2020winter\Valentina_SM\490log.log
  log type:  text
 opened on:   3 Dec 2020, 23:06:12

. **sample 
. count if TotInc<=0
 1762

. count if TotInc_AT<=0
 3868

. drop if TotInc<=0
(1762 observations deleted)

. drop if TotInc>=88888888
(194147 observations deleted)

. drop if TotInc_AT>=88888888  /* income 1-max */
(0 observations deleted)

. keep if AGEGRP>=9 & AGEGRP<=16  /* aged 25-64*/
(240421 observations deleted)

. 
. *** Define hybrid marriage 
. tab POBF

  Place of birth of father: |
                   Detailed |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
                     Canada |    301,016       64.03       64.03
                   Americas |     22,907        4.87       68.91
                     Europe |     62,742       13.35       82.25
               Eastern Asia |     22,387        4.76       87.01
Southeast and Southern Asia |     38,845        8.26       95.28
Other countries and regions |     22,199        4.72      100.00
----------------------------+-----------------------------------
                      Total |    470,096      100.00

. drop if POBF>5
(46194 observations deleted)

. tab POBM

  Place of birth of mother: |
                   Detailed |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
                     Canada |    305,931       68.30       68.30
                   Americas |     22,812        5.09       73.40
                     Europe |     57,635       12.87       86.26
               Eastern Asia |     22,217        4.96       91.23
Southeast and Southern Asia |     38,929        8.69       99.92
Other countries and regions |        373        0.08      100.00
----------------------------+-----------------------------------
                      Total |    447,897      100.00

. drop if POBM>5
(373 observations deleted)

. tab POBF  POBM

    Place of birth of |           Place of birth of mother: Detailed
     father: Detailed |    Canada   Americas     Europe  Eastern A  Southeast |     Total
----------------------+-------------------------------------------------------+----------
               Canada |   289,061      2,452      9,145         86         79 |   300,823 
             Americas |     2,724     20,006        165          2          8 |    22,905 
               Europe |    13,955        335     48,290          8         30 |    62,618 
         Eastern Asia |        85          6          0     22,078        216 |    22,385 
Southeast and Souther |       106         13         35         43     38,596 |    38,793 
----------------------+-------------------------------------------------------+----------
                Total |   305,931     22,812     57,635     22,217     38,929 |   447,524 


. 
. gen HYBRID=1

. replace HYBRID=0 if (POBF==POBM)
(418031 real changes made)

. replace HYBRID=. if POBF==.
(0 real changes made)

. replace HYBRID=. if POBM==.
(0 real changes made)

. tab HYBRID

     HYBRID |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    418,031       93.41       93.41
          1 |     29,493        6.59      100.00
------------+-----------------------------------
      Total |    447,524      100.00

. tab HYBRID if (POBF!=1 & POBM!=1)

     HYBRID |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    128,970       99.34       99.34
          1 |        861        0.66      100.00
------------+-----------------------------------
      Total |    129,831      100.00

. 
. gen EDU_YRS=.
(447524 missing values generated)

. replace EDU_YRS=6 if HDGREE==1
(51292 real changes made)

. replace EDU_YRS=12 if HDGREE==2 
(108839 real changes made)

. replace EDU_YRS=13 if HDGREE>=3 & HDGREE<=5
(65984 real changes made)

. replace EDU_YRS=14 if HDGREE>=6 & HDGREE<=8
(97557 real changes made)

. replace EDU_YRS=16 if HDGREE>=9 & HDGREE<=9
(82901 real changes made)

. replace EDU_YRS=17 if HDGREE>=10 & HDGREE<=10
(7364 real changes made)

. replace EDU_YRS=18 if HDGREE>=11 & HDGREE<=12
(26912 real changes made)

. replace EDU_YRS=20 if HDGREE>=13 & HDGREE<=13
(3105 real changes made)

. tab EDU_YRS

    EDU_YRS |      Freq.     Percent        Cum.
------------+-----------------------------------
          6 |     51,292       11.55       11.55
         12 |    108,839       24.52       36.07
         13 |     65,984       14.86       50.93
         14 |     97,557       21.97       72.91
         16 |     82,901       18.67       91.58
         17 |      7,364        1.66       93.24
         18 |     26,912        6.06       99.30
         20 |      3,105        0.70      100.00
------------+-----------------------------------
      Total |    443,954      100.00

. 
. gen LNINC=log(TotInc)

. gen LNINCAT=log(TotInc_AT)
(1382 missing values generated)

. 
. ** controls
. gen MALE=(Sex==2)

. 
. gen SINGLE=(MarStH==1)

. 
. gen EMPLOY=(LFACT ==1 | LFACT ==2)

. gen FULL=(FPTWK ==1)

. 
. 
. 
. ** sample aged 26-64
. keep if AGEGRP>=9 & AGEGRP<=16
(0 observations deleted)

. gen AGE=.
(447524 missing values generated)

. replace AGE=27 if AGEGRP==9
(52892 real changes made)

. replace AGE=32 if AGEGRP==10
(53709 real changes made)

. replace AGE=37 if AGEGRP==11
(52563 real changes made)

. replace AGE=42 if AGEGRP==12
(51954 real changes made)

. replace AGE=47 if AGEGRP==13
(54744 real changes made)

. replace AGE=52 if AGEGRP==14
(63710 real changes made)

. replace AGE=57 if AGEGRP==15
(62732 real changes made)

. replace AGE=62 if AGEGRP==16
(55220 real changes made)

. 
. gen AGE_SQ=AGE^2

. 
. ** summary 
. sum EDU_YRS TotInc TotInc_AT HYBRID MALE SINGLE AGE EMPLOY 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
     EDU_YRS |    443954    13.14445    3.147924          6         20
      TotInc |    447524    57818.59    79233.21          1    1586814
   TotInc_AT |    447524    46168.84    51394.46     -50000    1056608
      HYBRID |    447524    .0659026    .2481121          0          1
        MALE |    447524    .4910128    .4999198          0          1
-------------+--------------------------------------------------------
      SINGLE |    447524    .2080939    .4059448          0          1
         AGE |    447524    45.04546    11.42127         27         62
      EMPLOY |    447524    .7638719    .4247023          0          1

. 
. 
. ***regression
. eststo clear

. eststo: xi: reg EDU_YRS HYBRID MALE SINGLE AGE  

      Source |       SS       df       MS              Number of obs =  443954
-------------+------------------------------           F(  4,443949) = 3562.61
       Model |  136823.129     4  34205.7822           Prob > F      =  0.0000
    Residual |  4262495.75443949   9.6013185           R-squared     =  0.0311
-------------+------------------------------           Adj R-squared =  0.0311
       Total |  4399318.88443953  9.90942482           Root MSE      =  3.0986

------------------------------------------------------------------------------
     EDU_YRS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |   .3938994   .0187381    21.02   0.000     .3571734    .4306254
        MALE |  -.4521692   .0093239   -48.50   0.000    -.4704437   -.4338947
      SINGLE |  -.6755896   .0120176   -56.22   0.000    -.6991437   -.6520356
         AGE |  -.0431758   .0004256  -101.45   0.000    -.0440099   -.0423417
       _cons |   15.42611   .0210265   733.65   0.000      15.3849    15.46732
------------------------------------------------------------------------------
(est1 stored)

. eststo: xi: reg EDU_YRS HYBRID MALE SINGLE AGE  i.PR
i.PR              _IPR_10-70          (naturally coded; _IPR_10 omitted)

      Source |       SS       df       MS              Number of obs =  443954
-------------+------------------------------           F( 14,443939) = 1204.03
       Model |  160931.445    14  11495.1032           Prob > F      =  0.0000
    Residual |  4238387.43443939  9.54722931           R-squared     =  0.0366
-------------+------------------------------           Adj R-squared =  0.0366
       Total |  4399318.88443953  9.90942482           Root MSE      =  3.0899

------------------------------------------------------------------------------
     EDU_YRS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |   .3167367   .0187949    16.85   0.000     .2798992    .3535742
        MALE |  -.4485815   .0092985   -48.24   0.000    -.4668062   -.4303568
      SINGLE |  -.6714074   .0120087   -55.91   0.000    -.6949441   -.6478707
         AGE |  -.0430354   .0004254  -101.16   0.000    -.0438692   -.0422016
     _IPR_11 |   .2694628    .084869     3.18   0.001     .1031221    .4358034
     _IPR_12 |   .4304229   .0463311     9.29   0.000     .3396152    .5212305
     _IPR_13 |   .1046004   .0483325     2.16   0.030     .0098701    .1993307
     _IPR_24 |   .4170338   .0377692    11.04   0.000     .3430072    .4910603
     _IPR_35 |   .7861378   .0373316    21.06   0.000      .712969    .8593066
     _IPR_46 |   .1025318   .0443752     2.31   0.021     .0155578    .1895059
     _IPR_47 |   .1398623   .0453608     3.08   0.002     .0509565    .2287682
     _IPR_48 |   .5190516   .0389797    13.32   0.000     .4426526    .5954505
     _IPR_59 |   .7159647   .0387182    18.49   0.000     .6400781    .7918512
     _IPR_70 |    -.83717   .1023807    -8.18   0.000    -1.037833   -.6365069
       _cons |   14.84903    .042094   352.76   0.000     14.76653    14.93153
------------------------------------------------------------------------------
(est2 stored)

. esttab, se b(a2) nogap r2 star(* 0.10  ** 0.05 *** 0.01) 

--------------------------------------------
                      (1)             (2)   
                  EDU_YRS         EDU_YRS   
--------------------------------------------
HYBRID               0.39***         0.32***
                  (0.019)         (0.019)   
MALE                -0.45***        -0.45***
                 (0.0093)        (0.0093)   
SINGLE              -0.68***        -0.67***
                  (0.012)         (0.012)   
AGE                -0.043***       -0.043***
                (0.00043)       (0.00043)   
_IPR_11                              0.27***
                                  (0.085)   
_IPR_12                              0.43***
                                  (0.046)   
_IPR_13                              0.10** 
                                  (0.048)   
_IPR_24                              0.42***
                                  (0.038)   
_IPR_35                              0.79***
                                  (0.037)   
_IPR_46                              0.10** 
                                  (0.044)   
_IPR_47                              0.14***
                                  (0.045)   
_IPR_48                              0.52***
                                  (0.039)   
_IPR_59                              0.72***
                                  (0.039)   
_IPR_70                             -0.84***
                                   (0.10)   
_cons                15.4***         14.8***
                  (0.021)         (0.042)   
--------------------------------------------
N                  443954          443954   
R-sq                0.031           0.037   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. 
. eststo clear

. eststo: xi: reg LNINC HYBRID MALE  SINGLE EDU_YRS EMPLOY AGE

      Source |       SS       df       MS              Number of obs =  443954
-------------+------------------------------           F(  6,443947) =14629.24
       Model |  169335.366     6   28222.561           Prob > F      =  0.0000
    Residual |  856457.242443947  1.92918804           R-squared     =  0.1651
-------------+------------------------------           Adj R-squared =  0.1651
       Total |  1025792.61443953   2.3105883           Root MSE      =   1.389

------------------------------------------------------------------------------
       LNINC |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |    .067684   .0084036     8.05   0.000     .0512133    .0841547
        MALE |   .3313839   .0042111    78.69   0.000     .3231302    .3396375
      SINGLE |  -.2733031   .0054371   -50.27   0.000    -.2839596   -.2626465
     EDU_YRS |   .0681347   .0006832    99.72   0.000     .0667956    .0694738
      EMPLOY |   1.168758   .0051047   228.96   0.000     1.158753    1.178763
         AGE |   .0086002   .0001958    43.92   0.000     .0082165     .008984
       _cons |   8.118311   .0145105   559.48   0.000     8.089871    8.146751
------------------------------------------------------------------------------
(est1 stored)

. eststo: xi: reg LNINC HYBRID MALE  SINGLE EDU_YRS EMPLOY AGE AGE_SQ

      Source |       SS       df       MS              Number of obs =  443954
-------------+------------------------------           F(  7,443946) =12633.44
       Model |  170395.189     7  24342.1699           Prob > F      =  0.0000
    Residual |   855397.42443946  1.92680511           R-squared     =  0.1661
-------------+------------------------------           Adj R-squared =  0.1661
       Total |  1025792.61443953   2.3105883           Root MSE      =  1.3881

------------------------------------------------------------------------------
       LNINC |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |   .0709982   .0083995     8.45   0.000     .0545353    .0874611
        MALE |   .3323246   .0042087    78.96   0.000     .3240756    .3405735
      SINGLE |  -.2566156   .0054801   -46.83   0.000    -.2673565   -.2458747
     EDU_YRS |   .0679345   .0006829    99.49   0.000     .0665961    .0692729
      EMPLOY |   1.149762   .0051654   222.59   0.000     1.139638    1.159886
         AGE |   .0481507   .0016977    28.36   0.000     .0448233    .0514781
      AGE_SQ |  -.0004435   .0000189   -23.45   0.000    -.0004806   -.0004065
       _cons |   7.307591   .0374865   194.94   0.000     7.234118    7.381063
------------------------------------------------------------------------------
(est2 stored)

. eststo: xi: reg LNINC HYBRID MALE  SINGLE EDU_YRS EMPLOY AGE AGE_SQ i.PR
i.PR              _IPR_10-70          (naturally coded; _IPR_10 omitted)

      Source |       SS       df       MS              Number of obs =  443954
-------------+------------------------------           F( 17,443936) = 5383.01
       Model |  175314.246    17  10312.6027           Prob > F      =  0.0000
    Residual |  850478.362443936  1.91576795           R-squared     =  0.1709
-------------+------------------------------           Adj R-squared =  0.1709
       Total |  1025792.61443953   2.3105883           Root MSE      =  1.3841

------------------------------------------------------------------------------
       LNINC |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |   .0908305   .0084231    10.78   0.000     .0743214    .1073395
        MALE |   .3304296   .0041969    78.73   0.000     .3222039    .3386553
      SINGLE |  -.2523045    .005476   -46.07   0.000    -.2630372   -.2415718
     EDU_YRS |   .0692924   .0006828   101.49   0.000     .0679542    .0706306
      EMPLOY |   1.148245   .0051545   222.77   0.000     1.138142    1.158348
         AGE |   .0490426   .0016932    28.96   0.000      .045724    .0523612
      AGE_SQ |  -.0004496   .0000189   -23.84   0.000    -.0004866   -.0004127
     _IPR_11 |  -.1648479   .0380208    -4.34   0.000    -.2393674   -.0903284
     _IPR_12 |  -.2122615   .0207588   -10.23   0.000    -.2529481   -.1715749
     _IPR_13 |  -.1837962   .0216531    -8.49   0.000    -.2262356   -.1413567
     _IPR_24 |  -.1108902   .0169297    -6.55   0.000    -.1440719   -.0777085
     _IPR_35 |  -.2194905   .0167377   -13.11   0.000    -.2522959   -.1866852
     _IPR_46 |  -.2198548   .0198849   -11.06   0.000    -.2588285   -.1808811
     _IPR_47 |  -.0769596   .0203286    -3.79   0.000    -.1168031   -.0371162
     _IPR_48 |    .057323   .0174715     3.28   0.001     .0230794    .0915666
     _IPR_59 |  -.2987056    .017356   -17.21   0.000    -.3327227   -.2646884
     _IPR_70 |   .1682748   .0458666     3.67   0.000     .0783775     .258172
       _cons |   7.424424   .0407545   182.17   0.000     7.344547    7.504302
------------------------------------------------------------------------------
(est3 stored)

. esttab, se b(a2) nogap r2 star(* 0.10  ** 0.05 *** 0.01) 

------------------------------------------------------------
                      (1)             (2)             (3)   
                    LNINC           LNINC           LNINC   
------------------------------------------------------------
HYBRID              0.068***        0.071***        0.091***
                 (0.0084)        (0.0084)        (0.0084)   
MALE                 0.33***         0.33***         0.33***
                 (0.0042)        (0.0042)        (0.0042)   
SINGLE              -0.27***        -0.26***        -0.25***
                 (0.0054)        (0.0055)        (0.0055)   
EDU_YRS             0.068***        0.068***        0.069***
                (0.00068)       (0.00068)       (0.00068)   
EMPLOY               1.17***         1.15***         1.15***
                 (0.0051)        (0.0052)        (0.0052)   
AGE                0.0086***        0.048***        0.049***
                (0.00020)        (0.0017)        (0.0017)   
AGE_SQ                           -0.00044***     -0.00045***
                               (0.000019)      (0.000019)   
_IPR_11                                             -0.16***
                                                  (0.038)   
_IPR_12                                             -0.21***
                                                  (0.021)   
_IPR_13                                             -0.18***
                                                  (0.022)   
_IPR_24                                             -0.11***
                                                  (0.017)   
_IPR_35                                             -0.22***
                                                  (0.017)   
_IPR_46                                             -0.22***
                                                  (0.020)   
_IPR_47                                            -0.077***
                                                  (0.020)   
_IPR_48                                             0.057***
                                                  (0.017)   
_IPR_59                                             -0.30***
                                                  (0.017)   
_IPR_70                                              0.17***
                                                  (0.046)   
_cons                8.12***         7.31***         7.42***
                  (0.015)         (0.037)         (0.041)   
------------------------------------------------------------
N                  443954          443954          443954   
R-sq                0.165           0.166           0.171   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. *** robust 
. eststo clear

. eststo: xi: reg LNINCAT HYBRID MALE  SINGLE EDU_YRS EMPLOY AGE

      Source |       SS       df       MS              Number of obs =  442585
-------------+------------------------------           F(  6,442578) =13531.47
       Model |  144093.168     6  24015.5279           Prob > F      =  0.0000
    Residual |  785483.251442578  1.77479055           R-squared     =  0.1550
-------------+------------------------------           Adj R-squared =  0.1550
       Total |  929576.419442584  2.10033896           Root MSE      =  1.3322

------------------------------------------------------------------------------
     LNINCAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |    .065282   .0080753     8.08   0.000     .0494546    .0811093
        MALE |   .2893263    .004045    71.53   0.000     .2813982    .2972543
      SINGLE |  -.2530497   .0052182   -48.49   0.000    -.2632772   -.2428221
     EDU_YRS |   .0615042   .0006564    93.71   0.000     .0602178    .0627906
      EMPLOY |    1.09345   .0049124   222.59   0.000     1.083822    1.103078
         AGE |    .007363   .0001881    39.15   0.000     .0069943    .0077316
       _cons |   8.202646    .013933   588.72   0.000     8.175337    8.229954
------------------------------------------------------------------------------
(est1 stored)

. eststo: xi: reg LNINCAT HYBRID MALE  SINGLE EDU_YRS EMPLOY AGE AGE_SQ

      Source |       SS       df       MS              Number of obs =  442585
-------------+------------------------------           F(  7,442577) =11681.49
       Model |  144964.741     7  20709.2487           Prob > F      =  0.0000
    Residual |  784611.678442577  1.77282524           R-squared     =  0.1559
-------------+------------------------------           Adj R-squared =  0.1559
       Total |  929576.419442584  2.10033896           Root MSE      =  1.3315

------------------------------------------------------------------------------
     LNINCAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |    .068293    .008072     8.46   0.000     .0524722    .0841138
        MALE |   .2902426    .004043    71.79   0.000     .2823185    .2981667
      SINGLE |   -.237883     .00526   -45.22   0.000    -.2481925   -.2275736
     EDU_YRS |    .061318    .000656    93.47   0.000     .0600322    .0626039
      EMPLOY |   1.076346   .0049699   216.57   0.000     1.066605    1.086087
         AGE |   .0432818   .0016308    26.54   0.000     .0400854    .0464782
      AGE_SQ |  -.0004029   .0000182   -22.17   0.000    -.0004385   -.0003673
       _cons |   7.466434   .0360054   207.37   0.000     7.395865    7.537003
------------------------------------------------------------------------------
(est2 stored)

. eststo: xi: reg LNINCAT HYBRID MALE  SINGLE EDU_YRS EMPLOY AGE AGE_SQ i.PR
i.PR              _IPR_10-70          (naturally coded; _IPR_10 omitted)

      Source |       SS       df       MS              Number of obs =  442585
-------------+------------------------------           F( 17,442567) = 4964.37
       Model |  148874.118    17  8757.30109           Prob > F      =  0.0000
    Residual |    780702.3442567  1.76403189           R-squared     =  0.1602
-------------+------------------------------           Adj R-squared =  0.1601
       Total |  929576.419442584  2.10033896           Root MSE      =  1.3282

------------------------------------------------------------------------------
     LNINCAT |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |   .0833032   .0080978    10.29   0.000     .0674318    .0991745
        MALE |   .2883827   .0040332    71.50   0.000     .2804778    .2962876
      SINGLE |  -.2331563   .0052581   -44.34   0.000    -.2434619   -.2228506
     EDU_YRS |   .0624294   .0006562    95.14   0.000     .0611433    .0637155
      EMPLOY |   1.075128   .0049613   216.70   0.000     1.065404    1.084852
         AGE |   .0441182   .0016271    27.11   0.000      .040929    .0473073
      AGE_SQ |  -.0004084   .0000181   -22.53   0.000     -.000444   -.0003729
     _IPR_11 |  -.1374064   .0365369    -3.76   0.000    -.2090175   -.0657953
     _IPR_12 |   -.205856   .0199453   -10.32   0.000    -.2449482   -.1667638
     _IPR_13 |  -.1837987   .0207978    -8.84   0.000    -.2245618   -.1430355
     _IPR_24 |  -.1071101   .0162627    -6.59   0.000    -.1389846   -.0752356
     _IPR_35 |  -.1919959   .0160783   -11.94   0.000    -.2235089   -.1604828
     _IPR_46 |   -.202806   .0191046   -10.62   0.000    -.2402505   -.1653614
     _IPR_47 |   -.062868   .0195285    -3.22   0.001    -.1011433   -.0245927
     _IPR_48 |   .0609364   .0167836     3.63   0.000     .0280411    .0938318
     _IPR_59 |  -.2574138   .0166755   -15.44   0.000    -.2900972   -.2247304
     _IPR_70 |   .1571235    .044037     3.57   0.000     .0708123    .2434346
       _cons |   7.569282   .0391574   193.30   0.000     7.492535    7.646029
------------------------------------------------------------------------------
(est3 stored)

. esttab, se b(a2) nogap r2 star(* 0.10  ** 0.05 *** 0.01) 

------------------------------------------------------------
                      (1)             (2)             (3)   
                  LNINCAT         LNINCAT         LNINCAT   
------------------------------------------------------------
HYBRID              0.065***        0.068***        0.083***
                 (0.0081)        (0.0081)        (0.0081)   
MALE                 0.29***         0.29***         0.29***
                 (0.0040)        (0.0040)        (0.0040)   
SINGLE              -0.25***        -0.24***        -0.23***
                 (0.0052)        (0.0053)        (0.0053)   
EDU_YRS             0.062***        0.061***        0.062***
                (0.00066)       (0.00066)       (0.00066)   
EMPLOY               1.09***         1.08***         1.08***
                 (0.0049)        (0.0050)        (0.0050)   
AGE                0.0074***        0.043***        0.044***
                (0.00019)        (0.0016)        (0.0016)   
AGE_SQ                           -0.00040***     -0.00041***
                               (0.000018)      (0.000018)   
_IPR_11                                             -0.14***
                                                  (0.037)   
_IPR_12                                             -0.21***
                                                  (0.020)   
_IPR_13                                             -0.18***
                                                  (0.021)   
_IPR_24                                             -0.11***
                                                  (0.016)   
_IPR_35                                             -0.19***
                                                  (0.016)   
_IPR_46                                             -0.20***
                                                  (0.019)   
_IPR_47                                            -0.063***
                                                  (0.020)   
_IPR_48                                             0.061***
                                                  (0.017)   
_IPR_59                                             -0.26***
                                                  (0.017)   
_IPR_70                                              0.16***
                                                  (0.044)   
_cons                8.20***         7.47***         7.57***
                  (0.014)         (0.036)         (0.039)   
------------------------------------------------------------
N                  442585          442585          442585   
R-sq                0.155           0.156           0.160   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. 
. **heteroskedasticity 
. reg LNINC HYBRID MALE SINGLE EDU_YRS EMPLOY AGE i.PR

      Source |       SS       df       MS              Number of obs =  443954
-------------+------------------------------           F( 16,443937) = 5676.67
       Model |  174225.381    16  10889.0863           Prob > F      =  0.0000
    Residual |  851567.227443937  1.91821638           R-squared     =  0.1698
-------------+------------------------------           Adj R-squared =  0.1698
       Total |  1025792.61443953   2.3105883           Root MSE      =   1.385

---------------------------------------------------------------------------------------
                LNINC |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
               HYBRID |   .0874746   .0084273    10.38   0.000     .0709573     .103992
                 MALE |   .3294847   .0041994    78.46   0.000     .3212541    .3377153
               SINGLE |  -.2692604    .005433   -49.56   0.000     -.279909   -.2586118
              EDU_YRS |   .0694885   .0006831   101.72   0.000     .0681495    .0708274
               EMPLOY |   1.167535   .0050938   229.21   0.000     1.157551    1.177518
                  AGE |    .008946   .0001957    45.72   0.000     .0085625    .0093296
                      |
                   PR |
Prince Edward Island  |   -.166532    .038045    -4.38   0.000     -.241099    -.091965
         Nova Scotia  |  -.2147197   .0207718   -10.34   0.000    -.2554318   -.1740075
       New Brunswick  |  -.1847292   .0216669    -8.53   0.000    -.2271957   -.1422627
              Quebec  |  -.1129938   .0169403    -6.67   0.000    -.1461963   -.0797914
             Ontario  |  -.2210224   .0167483   -13.20   0.000    -.2538484   -.1881963
            Manitoba  |  -.2224547   .0198973   -11.18   0.000    -.2614527   -.1834567
        Saskatchewan  |  -.0819921   .0203405    -4.03   0.000    -.1218589   -.0421253
             Alberta  |   .0542094   .0174822     3.10   0.002     .0199449    .0884739
    British Columbia  |  -.3011039   .0173668   -17.34   0.000    -.3351422   -.2670656
     Northern Canada  |   .1673497   .0458959     3.65   0.000     .0773951    .2573043
                      |
                _cons |    8.24857   .0215987   381.90   0.000     8.206238    8.290903
---------------------------------------------------------------------------------------

. estat hettest 

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of LNINC

         chi2(1)      = 94759.14
         Prob > chi2  =   0.0000

. predict INC_RES, resid
(3570 missing values generated)

. kdensity INC_RES, normal title("Kernel density of income's residual")

. 
. reg EDU_YRS HYBRID MALE SINGLE AGE  i.PR

      Source |       SS       df       MS              Number of obs =  443954
-------------+------------------------------           F( 14,443939) = 1204.03
       Model |  160931.445    14  11495.1032           Prob > F      =  0.0000
    Residual |  4238387.43443939  9.54722931           R-squared     =  0.0366
-------------+------------------------------           Adj R-squared =  0.0366
       Total |  4399318.88443953  9.90942482           Root MSE      =  3.0899

---------------------------------------------------------------------------------------
              EDU_YRS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
               HYBRID |   .3167367   .0187949    16.85   0.000     .2798992    .3535742
                 MALE |  -.4485815   .0092985   -48.24   0.000    -.4668062   -.4303568
               SINGLE |  -.6714074   .0120087   -55.91   0.000    -.6949441   -.6478707
                  AGE |  -.0430354   .0004254  -101.16   0.000    -.0438692   -.0422016
                      |
                   PR |
Prince Edward Island  |   .2694628    .084869     3.18   0.001     .1031221    .4358034
         Nova Scotia  |   .4304229   .0463311     9.29   0.000     .3396152    .5212305
       New Brunswick  |   .1046004   .0483325     2.16   0.030     .0098701    .1993307
              Quebec  |   .4170338   .0377692    11.04   0.000     .3430072    .4910603
             Ontario  |   .7861378   .0373316    21.06   0.000      .712969    .8593066
            Manitoba  |   .1025318   .0443752     2.31   0.021     .0155578    .1895059
        Saskatchewan  |   .1398623   .0453608     3.08   0.002     .0509565    .2287682
             Alberta  |   .5190516   .0389797    13.32   0.000     .4426526    .5954505
    British Columbia  |   .7159647   .0387182    18.49   0.000     .6400781    .7918512
     Northern Canada  |    -.83717   .1023807    -8.18   0.000    -1.037833   -.6365069
                      |
                _cons |   14.84903    .042094   352.76   0.000     14.76653    14.93153
---------------------------------------------------------------------------------------

. estat hettest 

Breusch-Pagan / Cook-Weisberg test for heteroskedasticity 
         Ho: Constant variance
         Variables: fitted values of EDU_YRS

         chi2(1)      =  3874.55
         Prob > chi2  =   0.0000

. predict EDU_RES, resid
(3570 missing values generated)

. kdensity EDU_RES, normal title("Kernel density of years of schooling's residual")

. 
. 
. ****cluster
. eststo clear

. eststo: xi: reg EDU_YRS HYBRID MALE SINGLE AGE i.PR, cluster(AGEGRP)
i.PR              _IPR_10-70          (naturally coded; _IPR_10 omitted)

Linear regression                                      Number of obs =  443954
                                                       F(  6,     7) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0366
                                                       Root MSE      =  3.0899

                                 (Std. Err. adjusted for 8 clusters in AGEGRP)
------------------------------------------------------------------------------
             |               Robust
     EDU_YRS |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |   .3167367    .040831     7.76   0.000     .2201866    .4132867
        MALE |  -.4485815   .0938143    -4.78   0.002    -.6704171    -.226746
      SINGLE |  -.6714074   .1292244    -5.20   0.001    -.9769745   -.3658403
         AGE |  -.0430354   .0059397    -7.25   0.000    -.0570805   -.0289903
     _IPR_11 |   .2694628   .1465177     1.84   0.108    -.0769965    .6159221
     _IPR_12 |   .4304229   .0792655     5.43   0.001     .2429897    .6178561
     _IPR_13 |   .1046004   .0538801     1.94   0.093    -.0228058    .2320067
     _IPR_24 |   .4170338   .0957693     4.35   0.003     .1905754    .6434921
     _IPR_35 |   .7861378   .0979443     8.03   0.000     .5545364    1.017739
     _IPR_46 |   .1025318   .1351302     0.76   0.473    -.2170003     .422064
     _IPR_47 |   .1398623   .1286786     1.09   0.313    -.1644143    .4441389
     _IPR_48 |   .5190516   .1480306     3.51   0.010     .1690147    .8690884
     _IPR_59 |   .7159647   .1267238     5.65   0.001     .4163106    1.015619
     _IPR_70 |    -.83717   .2465724    -3.40   0.012    -1.420221   -.2541189
       _cons |   14.84903   .3151516    47.12   0.000     14.10381    15.59424
------------------------------------------------------------------------------
(est1 stored)

. eststo: xi: reg LNINC HYBRID MALE  SINGLE EDU_YRS EMPLOY AGE AGE_SQ i.PR, cluster(AGEGRP)
i.PR              _IPR_10-70          (naturally coded; _IPR_10 omitted)

Linear regression                                      Number of obs =  443954
                                                       F(  6,     7) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.1709
                                                       Root MSE      =  1.3841

                                 (Std. Err. adjusted for 8 clusters in AGEGRP)
------------------------------------------------------------------------------
             |               Robust
       LNINC |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      HYBRID |   .0908305   .0098307     9.24   0.000     .0675845    .1140764
        MALE |   .3304296   .0472104     7.00   0.000     .2187946    .4420645
      SINGLE |  -.2523045   .0309296    -8.16   0.000    -.3254414   -.1791675
     EDU_YRS |   .0692924   .0077336     8.96   0.000     .0510054    .0875794
      EMPLOY |   1.148245   .0763034    15.05   0.000     .9678162    1.328674
         AGE |   .0490426   .0163073     3.01   0.020     .0104819    .0876033
      AGE_SQ |  -.0004496   .0001824    -2.46   0.043     -.000881   -.0000182
     _IPR_11 |  -.1648479   .0668433    -2.47   0.043    -.3229072   -.0067885
     _IPR_12 |  -.2122615   .0149706   -14.18   0.000    -.2476613   -.1768617
     _IPR_13 |  -.1837962   .0179828   -10.22   0.000    -.2263187   -.1412736
     _IPR_24 |  -.1108902   .0205319    -5.40   0.001    -.1594404   -.0623401
     _IPR_35 |  -.2194905   .0255964    -8.58   0.000    -.2800164   -.1589646
     _IPR_46 |  -.2198548   .0326408    -6.74   0.000    -.2970381   -.1426715
     _IPR_47 |  -.0769596    .026975    -2.85   0.025    -.1407454   -.0131739
     _IPR_48 |    .057323   .0188967     3.03   0.019     .0126395    .1020065
     _IPR_59 |  -.2987056   .0205947   -14.50   0.000    -.3474043   -.2500069
     _IPR_70 |   .1682748   .0370413     4.54   0.003     .0806859    .2558636
       _cons |   7.424424   .2886973    25.72   0.000     6.741764    8.107085
------------------------------------------------------------------------------
(est2 stored)

. esttab, se b(a2) nogap r2 star(* 0.10  ** 0.05 *** 0.01) 

--------------------------------------------
                      (1)             (2)   
                  EDU_YRS           LNINC   
--------------------------------------------
HYBRID               0.32***        0.091***
                  (0.041)        (0.0098)   
MALE                -0.45***         0.33***
                  (0.094)         (0.047)   
SINGLE              -0.67***        -0.25***
                   (0.13)         (0.031)   
AGE                -0.043***        0.049** 
                 (0.0059)         (0.016)   
_IPR_11              0.27           -0.16** 
                   (0.15)         (0.067)   
_IPR_12              0.43***        -0.21***
                  (0.079)         (0.015)   
_IPR_13              0.10*          -0.18***
                  (0.054)         (0.018)   
_IPR_24              0.42***        -0.11***
                  (0.096)         (0.021)   
_IPR_35              0.79***        -0.22***
                  (0.098)         (0.026)   
_IPR_46              0.10           -0.22***
                   (0.14)         (0.033)   
_IPR_47              0.14          -0.077** 
                   (0.13)         (0.027)   
_IPR_48              0.52***        0.057** 
                   (0.15)         (0.019)   
_IPR_59              0.72***        -0.30***
                   (0.13)         (0.021)   
_IPR_70             -0.84**          0.17***
                   (0.25)         (0.037)   
EDU_YRS                             0.069***
                                 (0.0077)   
EMPLOY                               1.15***
                                  (0.076)   
AGE_SQ                           -0.00045** 
                                (0.00018)   
_cons                14.8***         7.42***
                   (0.32)          (0.29)   
--------------------------------------------
N                  443954          443954   
R-sq                0.037           0.171   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. 
. log close 
      name:  <unnamed>
       log:  C:\Data\DocEssay\2020winter\Valentina_SM\490log.log
  log type:  text
 closed on:   3 Dec 2020, 23:06:27
--------------------------------------------------------------------------------------------
